HidekiYamauchi/fabo-avr-boards/packages/fabo-avr-0.0.1/boards.txt
# FaBo AVR Boards

##############################################################

faboio.name=FaBo IO

faboio.upload.tool=arduino:avrdude
faboio.upload.protocol=arduino
faboio.upload.maximum_size=30720
faboio.upload.maximum_data_size=2048
faboio.upload.speed=57600

faboio.bootloader.tool=arduino:avrdude
faboio.bootloader.unlock_bits=0x3F
faboio.bootloader.lock_bits=0x0F
faboio.bootloader.low_fuses=0xFF
faboio.bootloader.high_fuses=0xDA
faboio.bootloader.extended_fuses=0xFD
faboio.bootloader.file=arduino:atmega/ATmegaBOOT_168_atmega328.hex

faboio.build.board=FABO_IO
faboio.build.core=arduino
faboio.build.variant=eightanaloginputs
faboio.build.mcu=atmega328p
faboio.build.f_cpu=16000000L

##############################################################

fabodonkey.name=FaBo Donkey

fabodonkey.upload.tool=arduino:avrdude
fabodonkey.upload.protocol=arduino
fabodonkey.upload.maximum_size=30720
fabodonkey.upload.maximum_data_size=2048
fabodonkey.upload.speed=57600

fabodonkey.bootloader.tool=arduino:avrdude
fabodonkey.bootloader.unlock_bits=0x3F
fabodonkey.bootloader.lock_bits=0x0F
fabodonkey.bootloader.low_fuses=0xFF
fabodonkey.bootloader.high_fuses=0xDA
fabodonkey.bootloader.extended_fuses=0xFD
fabodonkey.bootloader.file=arduino:atmega/ATmegaBOOT_168_atmega328.hex

fabodonkey.build.board=FABO_DONKEY
fabodonkey.build.core=arduino
fabodonkey.build.variant=eightanaloginputs
fabodonkey.build.mcu=atmega328p
fabodonkey.build.f_cpu=16000000L

